CoryPearl/opencalc/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# OpenCalc PCB target: ESP32-S3-WROOM-1-N16R8, 16 MB flash + 8 MB octal PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# The storage partition is generated from storage_image and exposed over USB MSC.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_WL_SECTOR_MODE_PERF=y
CONFIG_FATFS_SECTOR_4096=y
CONFIG_FATFS_USE_LABEL=y
# Keep FATFS directory and long-filename metadata in internal RAM. These
# structures are small and must not share the framebuffer-heavy PSRAM heap.
# CONFIG_FATFS_ALLOC_PREFER_EXTRAM is not set

# Keep wireless stacks off unless explicitly added later.
# CONFIG_ESP_WIFI_ENABLED is not set
# CONFIG_BT_ENABLED is not set
